export default [
  {
    icon: "1",
    title: "Поддержка и сопровождение",
    list: [
      "cопровождение и поддержка",
      "организация образовательного процесса",
      "привлечение клиентов",
      "помощь с помещением",
    ],
  },
  {
    icon: "2",
    title: "Администрирование",
    list: [
      "оптимизация процесса обучения",
      "прием звонков и обращений клиентов",
      "грамотно структурируем все процессы с CRM",
    ],
  },
  {
    icon: "3",
    title: "Подбор специалистов",
    list: [
      "дадим обратную связь",
      "обеспечим контроль качества",
      "подберем и обучим преподавателей",
    ],
  },
  {
    icon: "4",
    title: "большой спектр услуг",
    list: [
      "обучение БПЛА",
      "подготовка к ЕГЭ и ОГЭ",
      "программирование",
      "графический дизайн",
    ],
  },
  {
    icon: "5",
    title: "готовое оборудование",
    list: [
      "лицензионное ПО",
      "CRM",
      "IP-телефония",
      "настроенные комплекты FPV-дронов",
    ],
  },
  {
    icon: "6",
    title: "реклама",
    list: [
      "готовый рекламный материал",
      "специалист по настройке рекламы",
      "рекламный бюджет в паушальном взносе",
    ],
  },
];
