export default [
  {
    type: "fpv",
    bg: "linear-gradient(270deg, #11347E 0%, #2B1252 100%)",
    accent: "#0DD6FF",
    title: "Ваш ребенок мечтает управлять дроном?",
    texts: [
      "мы&nbsp;даем детям<br/> шанс взлететь!",
      "наша программа основана<br/> на&nbsp;завоевании интереса детей!",
      "вместе мы&nbsp;открываем<br/> двери в&nbsp;будущее!",
    ],
    list: [
      "история и сферы<br/> применения БПЛА",
      "техника безопасности<br/> при работе с квадрокоптером",
      "сборка и настройка<br/> квадрокоптера для полётов",
      "пилотирование<br/> дронов на симуляторах",
      "аэрофотосъёмка и планирование<br/> маршрутов полётов",
    ],
  },
  {
    type: "design",
    bg: "linear-gradient(270deg, #592A74 0%, #2B1252 100%)",
    accent: "#D737FF",
    title: "Ваш ребенок мечтает научиться дизайну?",
    texts: [
      "мы&nbsp;притворим самые<br/> смелые идеи детей в&nbsp;жизнь!",
      "наша&nbsp;программа основана<br/> на&nbsp;завоевании интереса детей!",
      "вместе мы открываем<br/> двери в будущее!",
    ],
    list: [
      "основы цветовой теории<br/> и композиции",
      "базовые навыки работы<br/> в Adobe Photoshop",
      "создание векторных<br/> изображений в Adobe Illustrator",
      "Практика рисования<br/> на графических планшетах",
      "3D-дизайн и создание<br/> объемных моделей",
    ],
  },
  {
    type: "dev",
    bg: "linear-gradient(270deg, #077792 0%, #2B1252 100%)",
    accent: "#FFBC4F",
    title: "ваш ребенок хочет&nbsp;научиться программировать?",
    texts: [
      "мы&nbsp;проведем время<br/> с&nbsp;пользой на&nbsp;нашем курсе!",
      "наша программа основана<br/> на&nbsp;завоевании интереса детей!",
      "вместе мы&nbsp;открываем<br/> двери в&nbsp;будущее!",
    ],
    list: [
      "Основы веб-разработки<br/> и алгоритмизации",
      "программирование на языках<br/> LUA, Scratch и Python",
      "Освоение 3D моделирования<br/> в увлекательной форме",
      "Погружение в мир нейросетей<br/> и их возможностей",
      "Тестирование программ<br/> и изучение их работы",
    ],
  },
];
