<template>
  <div class="root">
    <div class="root__wrapper">
      <h1 class="root__title">
        Политика ИСПОЛЬЗОВАНИЯ<br />
        СOOKIE-ФАЙЛОВ
      </h1>
      <p class="rote__text">
        Настоящая Политика использования Сookies (далее — «Политика»)
        применяется в дополнение к Политике обработки персональных данных,
        которая распространяется на продукты и сервисы ООО "Небесные Лапочки
        (далее — Компания). Политика описывает типы Сookies, цели
        их использования, как именно Компания обрабатывает данные, собранные
        в процессе использования посетителями веб-сайта https://skypaws.pro
        (далее — веб-сайт) и способы, с помощью которых можно отказаться
        от обработки Сookies. При первом посещении с помощью нового браузера или
        в режиме приватного просмотра предоставляется баннер, предупреждающий
        посетителей веб-сайта об осуществлении сбора Сookies на сайте
        и запрашивающий Ваше согласие на обработку Сookies. Нажимая кнопку
        «Принять» или продолжая пользоваться веб-сайтом Вы даете свое согласие
        на обработку Ваших Сookies. Вы также можете отказаться от обработки
        Сookies, однако такой отказ может привести к некорректной работе
        веб-сайта.
        <br /><br />
        <h3>1. Что такое Cookies?</h3>
        <br /><br />
        Сookies — это небольшой фрагмент данных, который веб-сайт запрашивает
        у браузера, используемого на вашем компьютере или мобильном устройстве.
        Cookies отражают Ваши предпочтения или действия на веб-сайте, а также
        сведения об оборудовании пользователя, дата и время сессии. Сookies
        хранятся локально на Вашем компьютере или мобильном устройстве. При
        желании Вы можете удалить сохраненные Сookies в настройках браузера.
        <br /><br />
        <h3>2. Как мы используем Ваши Cookies?</h3>
        <br /><br />
        Сookies используются Компанией в целях улучшения работы веб-сайта.<br />
        Сведения о действиях пользователей веб-сайта обрабатываются для
        совершенствования продуктов и услуг Компании, определения предпочтений
        пользователя, используются для улучшения персонализации
        и интерактивности в предоставлении целевой информации по продуктам
        и услугам на сайте Компании.
        <br /><br />
        <h3>3. Как мы обрабатываем Ваши Cookies?</h3>
        <br /><br />
        Веб-сайт обрабатывает полученные данные, в том числе, с использованием
        метрических программ, таких как Яндекс.Метрика.<br />
        Третьи лица не имеют доступа к Cookies веб-сайта. Третьи лица (Yandex
        и т.п.), которые собирают Cookie, включая Ваш браузер, имеют собственные
        политики использования Cookie.
        <br /><br />
        <h3>4. Какие виды Сookies мы используем?</h3>
        <br /><br />
        Сессионные
        <br />
        Существуют только во временной памяти в течение времени, когда
        пользователь находится на странице веб-сайта. Браузеры обычно удаляют
        сессионные Cookies после того, как Вы закрываете окно веб-сайта.
        Сессионные Cookies позволяют веб-сайту помнить информацию о Вашем выборе
        на предыдущем сайте, чтобы избежать необходимости повторного ввода
        информации.
        <br />
        Постоянные
        <br />
        Сookies, которые хранятся на Вашем компьютере и не удаляются при
        закрытии браузера. Постоянные Сookies могут сохранять пользовательские
        настройки для определенного веб-сайта, позволяя использовать эти
        предпочтения в будущих сеансах просмотра. Такие Cookies позволяют
        идентифицировать Вас как уникального пользователя веб-сайта, и при
        возвращении на веб-сайт помогают вспомнить информацию о Вас и ранее
        совершенных действиях.
        <br />
        Статистические
        <br />
        Включают в себя информацию о том, как Вы используете веб-сайт. Например,
        какие страницы Вы посещаете, по каким ссылкам переходите. Главная цель
        таких Cookies — улучшение функций сайта.
        <br />
        Обязательные
        <br />
        Минимальный набор Cookies, использование которых необходимо для
        корректной работы сайта.
        <br /><br />
        <h3>5. Как отказаться от обработки Сookies?</h3>
        <br /><br />
        Вы можете отказаться от обработки Cookies в настройках своего браузера
        (просим Вас ознакомиться с данной возможностью в разделе «Справка»
        вашего браузера). В таком случае наш сайт будет использовать только
        те Cookies, которые строго необходимы для функционирования сайта
        и предлагаемых им сервисов.
        <br /><br />
        <h3>6. Как с нами связаться?</h3>
        <br /><br />
        В случае возникновения вопросов, связанных с обработкой ваших
        персональных данных или реализации прав субъекта персональных данных,
        пожалуйста, свяжитесь с нами, используя один из способов, указанных
        в Политике ООО "Небесные Лапочки в области обработки и обеспечения
        безопасности персональных данных.
      </p>

      <a href="/cookie.pdf"
target="_blank"
download>Скачать документ</a>
    </div>
  </div>
</template>

<style lang="less">
.root {
  background: #2b1252;

  &__wrapper {
    width: 100%;
    height: 100%;
    padding: 100px 40px;
    color: #fff;

    .tablet-max({
        padding: 100px 20px;
      });
  }

  &__title {
    text-align: center;
    font-weight: 900;
    color: #fff;
    font-size: 40px;
    margin-bottom: 40px;
    text-transform: uppercase;

    .tablet-max({
        font-size: 22px;
        margin-bottom: 32px;
      });
  }

  &__text {
    color: #fff;
    font-weight: 400;
    font-size: 20px;
    line-height: 27px;

    .tablet-max({
        font-size: 16px;
      });
  }

  h3 {
    font-size: 32px;

    .tablet-max({
          font-size: 20px;
        });
  }


  a {
      color: #fff;
      margin-top: 32px;
      font-size: 20px;
      display: block;
    }
}
</style>
