<template>
  <section class="the-services-qr">
    <div class="the-services-qr__wrapper">
      <h3 class="the-services-qr__title">остались вопросы?</h3>
      <p class="the-services-qr__text">
        Наш&nbsp;менеджер с&nbsp;радостью поможет Вам найти решение!
      </p>
      <img
        v-if="isDesktop"
        class="the-services-qr__qr"
        src="@/assets/images/slug/qr.png"
        alt="qr code"
      />
      <div class="the-services-qr__soc">
        <a
          href="https://t.me/+jyYtUDbQz9VmZTUy"
          target="_blank"
        >
          <svg
            class="tg"
            width="57"
            height="57"
            viewBox="0 0 57 57"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            :style="{ background: accent }"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M46.7262 10.9317C47.3025 10.6891 47.9334 10.6054 48.553 10.6894C49.1727 10.7734 49.7585 11.0219 50.2496 11.4091C50.7406 11.7963 51.1189 12.308 51.345 12.891C51.5712 13.474 51.6369 14.107 51.5354 14.724L46.2457 46.8097C45.7326 49.9047 42.3368 51.6796 39.4983 50.1379C37.124 48.8482 33.5976 46.861 30.4256 44.7876C28.8396 43.7497 23.9814 40.4262 24.5785 38.0612C25.0916 36.0391 33.2547 28.4404 37.9193 23.9227C39.7502 22.1478 38.9152 21.1239 36.7532 22.7565C31.3842 26.8101 22.7639 32.9744 19.9139 34.7097C17.3996 36.2397 16.0889 36.5009 14.5215 36.2397C11.6621 35.7639 9.01027 35.0268 6.84588 34.1289C3.92116 32.9161 4.06343 28.8952 6.84355 27.7244L46.7262 10.9317Z"
              fill="white"
            />
          </svg>
        </a>
        <a
          href="tel:+7(800) 777-21-32"
          target="_blank"
        >
          <svg
            class="wa"
            width="57"
            height="57"
            viewBox="0 0 57 57"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            :style="{ background: accent }"
          >
            <path
              d="M44.9424 12.2642C42.8038 10.1047 40.2568 8.39249 37.4498 7.22726C34.6428 6.06203 31.632 5.46711 28.5928 5.47718C15.8584 5.47718 5.47955 15.856 5.47955 28.5904C5.47955 32.672 6.55242 36.6369 8.55821 40.1354L5.29297 52.1235L17.5376 48.9049C20.9195 50.7475 24.7212 51.727 28.5928 51.727C41.3273 51.727 51.7061 41.3482 51.7061 28.6138C51.7061 22.4331 49.3038 16.6257 44.9424 12.2642ZM28.5928 47.8087C25.141 47.8087 21.7591 46.8758 18.7971 45.1266L18.0974 44.7068L10.8206 46.6193L12.7564 39.529L12.2899 38.806C10.3717 35.7438 9.35336 32.2038 9.3512 28.5904C9.3512 18.0017 17.9808 9.37215 28.5695 9.37215C33.7006 9.37215 38.5285 11.3779 42.1436 15.0164C43.9339 16.7979 45.3527 18.9173 46.3176 21.2514C47.2824 23.5856 47.7743 26.0881 47.7645 28.6138C47.8111 39.2025 39.1815 47.8087 28.5928 47.8087ZM39.1349 33.4417C38.5518 33.1618 35.7064 31.7624 35.1933 31.5525C34.6568 31.3659 34.2837 31.2726 33.8872 31.8324C33.4907 32.4154 32.3945 33.7215 32.068 34.0947C31.7414 34.4912 31.3916 34.5379 30.8085 34.2346C30.2254 33.9548 28.3596 33.325 26.1672 31.3659C24.4413 29.8266 23.2985 27.9374 22.9486 27.3543C22.6221 26.7712 22.902 26.468 23.2052 26.1648C23.4617 25.9083 23.7882 25.4885 24.0681 25.1619C24.348 24.8354 24.4646 24.5789 24.6512 24.2057C24.8378 23.8092 24.7445 23.4827 24.6046 23.2028C24.4646 22.9229 23.2985 20.0775 22.832 18.9113C22.3655 17.7918 21.8757 17.9318 21.5259 17.9084H20.4064C20.0099 17.9084 19.4035 18.0484 18.8671 18.6314C18.3539 19.2145 16.8613 20.6139 16.8613 23.4593C16.8613 26.3048 18.937 29.0569 19.2169 29.4301C19.4968 29.8266 23.2985 35.6574 29.0826 38.1529C30.4587 38.7593 31.5315 39.1092 32.3712 39.3657C33.7472 39.8089 35.0067 39.7389 36.0096 39.599C37.1291 39.4357 39.4381 38.1996 39.9046 36.8468C40.3943 35.4941 40.3943 34.3513 40.2311 34.0947C40.0678 33.8382 39.718 33.7215 39.1349 33.4417Z"
              fill="white"
            />
          </svg>
        </a>
      </div>
    </div>
  </section>
</template>

<script>
import { mapGetters } from "vuex";

export default {
  name: "TheServicesQr",
  props: {
    accent: {
      type: String,
      required: true,
    },
  },

  computed: {
    ...mapGetters({
      isDesktop: "mqHelper/isDesktop",
    }),
  },
};
</script>

<style lang="less">
.the-services-qr {
  height: 100vh;

  &__wrapper {
    height: 100%;
    width: 100%;
    display: flex;
    flex-direction: column;
    align-items: center;
    justify-content: center;
  }

  &__title {
    font-size: 64px;
    color: @white;
    font-weight: 900;
    text-transform: uppercase;

    .tablet-max({
      font-size: 48px;
    });

    .mobile-max({
      font-size: 24px;
    });
  }

  &__text {
    margin-top: 5px;
    font-size: 20px;
    color: @white;
    font-weight: 500;

    .tablet-max({
      font-size: 18px;
    });

    .mobile-max({
      font-size: 16px;
      width: 86%;
      text-align: center
    });
  }

  &__qr {
    width: 209px;
    height: 209px;
    margin-top: 40px;

    .tablet-max({
      display: none;
    });
  }

  &__soc {
    display: none;
    gap: 20px;
    margin-top: 20px;

    .tablet-max({
      display: flex;
    });

    svg {
      padding: 13px;
      border-radius: 50%;
    }
  }
}
</style>
